1s/ERP/extensions/liko/Reports/ГруппаОтчетовДляЗакупщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ГруппаОтчетовДляЗакупщиков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРабочихЦентров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ОтображениеРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

1s/ERP/extensions/liko/AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КРазмещению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Reports/ГруппаОтчетовДляЗакупщиков/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Перем НомерСтрокиТаблицы;
&НаСервере
Перем МассивКолонок;

&НаСервере
Процедура ОстаткиДляПроизводстваВ4(ТабДокументГотовый="", ВыводитьШапку=Ложь) //+Лико m.shenderov 09.01.2018
	Если  ПоРабочимЦентрам Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель КАК КоличествоУУ,
		|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Склад
		|ПОМЕСТИТЬ ВтНоменклатура
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка В (&СписокРЦ)) КАК ТоварыВЯчейкахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Значение КАК ГруппаНоменклатуры,
		|	ПОДСТРОКА(ВЫРАЗИТЬ(ВтНоменклатура.ОбъектНоменклатуры.Номенклатура.Код КАК СТРОКА(11)), 2, 13) КАК КодНоменклатуры,
		|	ВтНоменклатура.Номенклатура КАК Номенклатура,
		|	ВтНоменклатура.Склад КАК Склад,
		|	ВтНоменклатура.ОбъектНоменклатуры.Втулка КАК Втулка,
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер КАК Нарезка,
		|	СУММА(ВтНоменклатура.Количество) КАК КоличествоОстаток,
		|	СУММА(ВтНоменклатура.КоличествоУУ) КАК КоличествоУУОстаток,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтНоменклатура.ОбъектНоменклатуры) КАК ОбъектНоменклатуры,
		|	ВтНоменклатура.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ВтНоменклатура.Количество) КАК Намотка,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Количество < 100
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 200
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 300
		|			ТОГДА 200
		|		КОГДА ВтНоменклатура.Количество < 400
		|			ТОГДА 300
		|		КОГДА ВтНоменклатура.Количество < 500
		|			ТОГДА 400
		|		КОГДА ВтНоменклатура.Количество < 600
		|			ТОГДА 500
		|		КОГДА ВтНоменклатура.Количество < 1000
		|			ТОГДА 600
		|		КОГДА ВтНоменклатура.Количество < 2000
		|			ТОГДА 1000
		|		КОГДА ВтНоменклатура.Количество < 3000
		|			ТОГДА 2000
		|		КОГДА ВтНоменклатура.Количество < 4000
		|			ТОГДА 3000
		|		КОГДА ВтНоменклатура.Количество < 5000
		|			ТОГДА 4000
		|		КОГДА ВтНоменклатура.Количество < 6000
		|			ТОГДА 5000
		|		КОГДА ВтНоменклатура.Количество < 7000
		|			ТОГДА 6000
		|		КОГДА ВтНоменклатура.Количество < 8000
		|			ТОГДА 7000
		|		КОГДА ВтНоменклатура.Количество < 9000
		|			ТОГДА 8000
		|		КОГДА ВтНоменклатура.Количество < 10000
		|			ТОГДА 9000
		|		КОГДА ВтНоменклатура.Количество < 11000
		|			ТОГДА 10000
		|		КОГДА ВтНоменклатура.Количество < 12000
		|			ТОГДА 11000
		|		ИНАЧЕ ВтНоменклатура.Количество
		|	КОНЕЦ КАК НамоткаДляБригадиров,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Номенклатура.ВидНоменклатуры = &НезавершеннаяПродукция
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Незавершеннка,
		|	ВтНоменклатура.Номенклатура.ЦеноваяГруппа.Код КАК КодЦеновойГруппы
		|ИЗ
		|	ВтНоменклатура КАК ВтНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО ВтНоменклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Материал вид"")
		|ГДЕ
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер > 0
		|	И ВтНоменклатура.Количество <> 0
		|	И ВтНоменклатура.Номенклатура.ВидНоменклатуры <> &НезавершеннаяПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураДополнительныеРеквизиты.Значение,
		|	ПОДСТРОКА(ВЫРАЗИТЬ(ВтНоменклатура.ОбъектНоменклатуры.Номенклатура.Код КАК СТРОКА(11)), 2, 13),
		|	ВтНоменклатура.Номенклатура,
		|	ВтНоменклатура.Склад,
		|	ВтНоменклатура.ОбъектНоменклатуры.Втулка,
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер,
		|	ВтНоменклатура.Номенклатура.Артикул,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Количество < 100
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 200
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 300
		|			ТОГДА 200
		|		КОГДА ВтНоменклатура.Количество < 400
		|			ТОГДА 300
		|		КОГДА ВтНоменклатура.Количество < 500
		|			ТОГДА 400
		|		КОГДА ВтНоменклатура.Количество < 600
		|			ТОГДА 500
		|		КОГДА ВтНоменклатура.Количество < 1000
		|			ТОГДА 600
		|		КОГДА ВтНоменклатура.Количество < 2000
		|			ТОГДА 1000
		|		КОГДА ВтНоменклатура.Количество < 3000
		|			ТОГДА 2000
		|		КОГДА ВтНоменклатура.Количество < 4000
		|			ТОГДА 3000
		|		КОГДА ВтНоменклатура.Количество < 5000
		|			ТОГДА 4000
		|		КОГДА ВтНоменклатура.Количество < 6000
		|			ТОГДА 5000
		|		КОГДА ВтНоменклатура.Количество < 7000
		|			ТОГДА 6000
		|		КОГДА ВтНоменклатура.Количество < 8000
		|			ТОГДА 7000
		|		КОГДА ВтНоменклатура.Количество < 9000
		|			ТОГДА 8000
		|		КОГДА ВтНоменклатура.Количество < 10000
		|			ТОГДА 9000
		|		КОГДА ВтНоменклатура.Количество < 11000
		|			ТОГДА 10000
		|		КОГДА ВтНоменклатура.Количество < 12000
		|			ТОГДА 11000
		|		ИНАЧЕ ВтНоменклатура.Количество
		|	КОНЕЦ,
		|	ВтНоменклатура.Номенклатура.ЦеноваяГруппа.Код,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Номенклатура.ВидНоменклатуры = &НезавершеннаяПродукция
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВтНоменклатура.Номенклатура.Наименование,
		|	ВтНоменклатура.Номенклатура.Артикул,
		|	Нарезка
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(КоличествоУУОстаток),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектНоменклатуры)
		|ПО
		|	ОБЩИЕ,
		|	КодНоменклатуры,
		|	Номенклатура";
		//Запрос.УстановитьПараметр("НезавершеннаяПродукция",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
	ИначеЕсли СкладБрака Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель КАК КоличествоУУ,
		|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Склад
		|ПОМЕСТИТЬ ВтНоменклатура
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка.Помещение.Наименование = ""Склад брака"") КАК ТоварыВЯчейкахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Значение КАК ГруппаНоменклатуры,
		|	ПОДСТРОКА(ВЫРАЗИТЬ(ВтНоменклатура.ОбъектНоменклатуры.Номенклатура.Код КАК СТРОКА(11)), 2, 13) КАК КодНоменклатуры,
		|	ВтНоменклатура.Номенклатура КАК Номенклатура,
		|	ВтНоменклатура.Склад КАК Склад,
		|	ВтНоменклатура.ОбъектНоменклатуры.Втулка КАК Втулка,
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер КАК Нарезка,
		|	СУММА(ВтНоменклатура.Количество) КАК КоличествоОстаток,
		|	СУММА(ВтНоменклатура.КоличествоУУ) КАК КоличествоУУОстаток,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтНоменклатура.ОбъектНоменклатуры) КАК ОбъектНоменклатуры,
		|	ВтНоменклатура.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ВтНоменклатура.Количество) КАК Намотка,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Количество < 100
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 200
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 300
		|			ТОГДА 200
		|		КОГДА ВтНоменклатура.Количество < 400
		|			ТОГДА 300
		|		КОГДА ВтНоменклатура.Количество < 500
		|			ТОГДА 400
		|		КОГДА ВтНоменклатура.Количество < 600
		|			ТОГДА 500
		|		КОГДА ВтНоменклатура.Количество < 1000
		|			ТОГДА 600
		|		КОГДА ВтНоменклатура.Количество < 2000
		|			ТОГДА 1000
		|		КОГДА ВтНоменклатура.Количество < 3000
		|			ТОГДА 2000
		|		КОГДА ВтНоменклатура.Количество < 4000
		|			ТОГДА 3000
		|		КОГДА ВтНоменклатура.Количество < 5000
		|			ТОГДА 4000
		|		КОГДА ВтНоменклатура.Количество < 6000
		|			ТОГДА 5000
		|		КОГДА ВтНоменклатура.Количество < 7000
		|			ТОГДА 6000
		|		КОГДА ВтНоменклатура.Количество < 8000
		|			ТОГДА 7000
		|		КОГДА ВтНоменклатура.Количество < 9000
		|			ТОГДА 8000
		|		КОГДА ВтНоменклатура.Количество < 10000
		|			ТОГДА 9000
		|		КОГДА ВтНоменклатура.Количество < 11000
		|			ТОГДА 10000
		|		КОГДА ВтНоменклатура.Количество < 12000
		|			ТОГДА 11000
		|		ИНАЧЕ ВтНоменклатура.Количество
		|	КОНЕЦ КАК НамоткаДляБригадиров,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Номенклатура.ВидНоменклатуры = &НезавершеннаяПродукция
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Незавершеннка,
		|	ВтНоменклатура.Номенклатура.ЦеноваяГруппа.Код КАК КодЦеновойГруппы
		|ИЗ
		|	ВтНоменклатура КАК ВтНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО ВтНоменклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Материал вид"")
		|ГДЕ
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер > 0
		|	И ВтНоменклатура.Количество <> 0
		|	И ВтНоменклатура.Номенклатура.ВидНоменклатуры <> &НезавершеннаяПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураДополнительныеРеквизиты.Значение,
		|	ПОДСТРОКА(ВЫРАЗИТЬ(ВтНоменклатура.ОбъектНоменклатуры.Номенклатура.Код КАК СТРОКА(11)), 2, 13),
		|	ВтНоменклатура.Номенклатура,
		|	ВтНоменклатура.Склад,
		|	ВтНоменклатура.ОбъектНоменклатуры.Втулка,
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер,
		|	ВтНоменклатура.Номенклатура.Артикул,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Количество < 100
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 200
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 300
		|			ТОГДА 200
		|		КОГДА ВтНоменклатура.Количество < 400
		|			ТОГДА 300
		|		КОГДА ВтНоменклатура.Количество < 500
		|			ТОГДА 400
		|		КОГДА ВтНоменклатура.Количество < 600
		|			ТОГДА 500
		|		КОГДА ВтНоменклатура.Количество < 1000
		|			ТОГДА 600
		|		КОГДА ВтНоменклатура.Количество < 2000
		|			ТОГДА 1000
		|		КОГДА ВтНоменклатура.Количество < 3000
		|			ТОГДА 2000
		|		КОГДА ВтНоменклатура.Количество < 4000
		|			ТОГДА 3000
		|		КОГДА ВтНоменклатура.Количество < 5000
		|			ТОГДА 4000
		|		КОГДА ВтНоменклатура.Количество < 6000
		|			ТОГДА 5000
		|		КОГДА ВтНоменклатура.Количество < 7000
		|			ТОГДА 6000
		|		КОГДА ВтНоменклатура.Количество < 8000
		|			ТОГДА 7000
		|		КОГДА ВтНоменклатура.Количество < 9000
		|			ТОГДА 8000
		|		КОГДА ВтНоменклатура.Количество < 10000
		|			ТОГДА 9000
		|		КОГДА ВтНоменклатура.Количество < 11000
		|			ТОГДА 10000
		|		КОГДА ВтНоменклатура.Количество < 12000
		|			ТОГДА 11000
		|		ИНАЧЕ ВтНоменклатура.Количество
		|	КОНЕЦ,
		|	ВтНоменклатура.Номенклатура.ЦеноваяГруппа.Код,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Номенклатура.ВидНоменклатуры = &НезавершеннаяПродукция
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВтНоменклатура.Номенклатура.Наименование,
		|	ВтНоменклатура.Номенклатура.Артикул,
		|	Нарезка
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(КоличествоУУОстаток),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектНоменклатуры)
		|ПО
		|	ОБЩИЕ,
		|	КодНоменклатуры,
		|	Номенклатура";
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель КАК КоличествоУУ,
		|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Склад
		|ПОМЕСТИТЬ ВтНоменклатура
		|ИЗ
		//|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка.Помещение.Наименование = ""СИМ"") КАК ТоварыВЯчейкахОстатки
		//+ Лико m.shenderov 13.06.2018
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка.Помещение В(&Помещение)) КАК ТоварыВЯчейкахОстатки 
		//- Лико m.shenderov 13.06.2018

		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Значение КАК ГруппаНоменклатуры,
		|	ПОДСТРОКА(ВЫРАЗИТЬ(ВтНоменклатура.ОбъектНоменклатуры.Номенклатура.Код КАК СТРОКА(11)), 2, 13) КАК КодНоменклатуры,
		|	ВтНоменклатура.Номенклатура КАК Номенклатура,
		|	ВтНоменклатура.Склад КАК Склад,
		|	ВтНоменклатура.ОбъектНоменклатуры.Втулка КАК Втулка,
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер КАК Нарезка,
		|	СУММА(ВтНоменклатура.Количество) КАК КоличествоОстаток,
		|	СУММА(ВтНоменклатура.КоличествоУУ) КАК КоличествоУУОстаток,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтНоменклатура.ОбъектНоменклатуры) КАК ОбъектНоменклатуры,
		|	ВтНоменклатура.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ВтНоменклатура.Количество) КАК Намотка,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Количество < 100
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 200
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 300
		|			ТОГДА 200
		|		КОГДА ВтНоменклатура.Количество < 400
		|			ТОГДА 300
		|		КОГДА ВтНоменклатура.Количество < 500
		|			ТОГДА 400
		|		КОГДА ВтНоменклатура.Количество < 600
		|			ТОГДА 500
		|		КОГДА ВтНоменклатура.Количество < 1000
		|			ТОГДА 600
		|		КОГДА ВтНоменклатура.Количество < 2000
		|			ТОГДА 1000
		|		КОГДА ВтНоменклатура.Количество < 3000
		|			ТОГДА 2000
		|		КОГДА ВтНоменклатура.Количество < 4000
		|			ТОГДА 3000
		|		КОГДА ВтНоменклатура.Количество < 5000
		|			ТОГДА 4000
		|		КОГДА ВтНоменклатура.Количество < 6000
		|			ТОГДА 5000
		|		КОГДА ВтНоменклатура.Количество < 7000
		|			ТОГДА 6000
		|		КОГДА ВтНоменклатура.Количество < 8000
		|			ТОГДА 7000
		|		КОГДА ВтНоменклатура.Количество < 9000
		|			ТОГДА 8000
		|		КОГДА ВтНоменклатура.Количество < 10000
		|			ТОГДА 9000
		|		КОГДА ВтНоменклатура.Количество < 11000
		|			ТОГДА 10000
		|		КОГДА ВтНоменклатура.Количество < 12000
		|			ТОГДА 11000
		|		ИНАЧЕ ВтНоменклатура.Количество
		|	КОНЕЦ КАК НамоткаДляБригадиров,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Номенклатура.ВидНоменклатуры = &НезавершеннаяПродукция
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Незавершеннка,
		|	ВтНоменклатура.Номенклатура.ЦеноваяГруппа.Код КАК КодЦеновойГруппы
		|ИЗ
		|	ВтНоменклатура КАК ВтНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО ВтНоменклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Заголовок = ""Материал вид"")
		|ГДЕ
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер > 0
		|	И ВтНоменклатура.Количество <> 0
		|	И ВтНоменклатура.Номенклатура.ВидНоменклатуры <> &НезавершеннаяПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураДополнительныеРеквизиты.Значение,
		|	ПОДСТРОКА(ВЫРАЗИТЬ(ВтНоменклатура.ОбъектНоменклатуры.Номенклатура.Код КАК СТРОКА(11)), 2, 13),
		|	ВтНоменклатура.Номенклатура,
		|	ВтНоменклатура.Склад,
		|	ВтНоменклатура.ОбъектНоменклатуры.Втулка,
		|	ВтНоменклатура.ОбъектНоменклатуры.Нарезка.Размер,
		|	ВтНоменклатура.Номенклатура.Артикул,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Количество < 100
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 200
		|			ТОГДА 100
		|		КОГДА ВтНоменклатура.Количество < 300
		|			ТОГДА 200
		|		КОГДА ВтНоменклатура.Количество < 400
		|			ТОГДА 300
		|		КОГДА ВтНоменклатура.Количество < 500
		|			ТОГДА 400
		|		КОГДА ВтНоменклатура.Количество < 600
		|			ТОГДА 500
		|		КОГДА ВтНоменклатура.Количество < 1000
		|			ТОГДА 600
		|		КОГДА ВтНоменклатура.Количество < 2000
		|			ТОГДА 1000
		|		КОГДА ВтНоменклатура.Количество < 3000
		|			ТОГДА 2000
		|		КОГДА ВтНоменклатура.Количество < 4000
		|			ТОГДА 3000
		|		КОГДА ВтНоменклатура.Количество < 5000
		|			ТОГДА 4000
		|		КОГДА ВтНоменклатура.Количество < 6000
		|			ТОГДА 5000
		|		КОГДА ВтНоменклатура.Количество < 7000
		|			ТОГДА 6000
		|		КОГДА ВтНоменклатура.Количество < 8000
		|			ТОГДА 7000
		|		КОГДА ВтНоменклатура.Количество < 9000
		|			ТОГДА 8000
		|		КОГДА ВтНоменклатура.Количество < 10000
		|			ТОГДА 9000
		|		КОГДА ВтНоменклатура.Количество < 11000
		|			ТОГДА 10000
		|		КОГДА ВтНоменклатура.Количество < 12000
		|			ТОГДА 11000
		|		ИНАЧЕ ВтНоменклатура.Количество
		|	КОНЕЦ,
		|	ВтНоменклатура.Номенклатура.ЦеноваяГруппа.Код,
		|	ВЫБОР
		|		КОГДА ВтНоменклатура.Номенклатура.ВидНоменклатуры = &НезавершеннаяПродукция
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВтНоменклатура.Номенклатура.Наименование,
		|	ВтНоменклатура.Номенклатура.Артикул,
		|	Нарезка
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(КоличествоУУОстаток),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектНоменклатуры)
		|ПО
		|	ОБЩИЕ,
		|	КодНоменклатуры,
		|	Номенклатура"; 		
		
		
		//Запрос.УстановитьПараметр("НезавершеннаяПродукция",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
		//Запрос.УстановитьПараметр("СписокРЦ",СписокЗначенийРЦ());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НезавершеннаяПродукция",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
	//Запрос.УстановитьПараметр("Помещение",Помещение);
	Запрос.УстановитьПараметр("Помещение",ТзПомещения.Выгрузить(,"Помещение"));
	Запрос.УстановитьПараметр("СписокРЦ",СписокЗначенийРЦ());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ВыборкаИтогов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогов.Следующий();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");  
	
	Макет = ОтчетОбъект.ПолучитьМакет("ОстаткиДляПроизводства_МакетТаблицы");
	
	//Макет = ПолучитьМакет("ОстаткиДляПроизводства_МакетТаблицы");
	
	ОбластьСтрокаНоменклатуры	= Макет.ПолучитьОбласть("СтрокаНоменклатуры");
	ОбластьСтрокаНарезки		= Макет.ПолучитьОбласть("СтрокаНарезки");
	ОбластьИтого				= Макет.ПолучитьОбласть("Итого");
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	УстановитьПараметрыПечатиСтолбца(ТабДокумент);
	
	
	
	// Выводим шапку
	ВывестиШапку(ТабДокумент);
	
	ВыборкаКодНоменклатуры = ВыборкаИтогов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКодНоменклатуры.Следующий() Цикл
		
		ВыборкаНоменклатуры = ВыборкаКодНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			
			ОбластьСтрокаНоменклатуры.Параметры.Заполнить(ВыборкаНоменклатуры);
			ОбластьСтрокаНоменклатуры.Параметры.Артикул = СокрЛП(ВыборкаНоменклатуры.Номенклатура.Артикул);
			ОбластьСтрокаНоменклатуры.Параметры.КодНоменклатуры = ПолучитьБезПрефикса(ВыборкаНоменклатуры.КодНоменклатуры);
			ОбластьСтрокаНоменклатуры.Параметры.КодЦеновойГруппы = СокрЛП(ВыборкаНоменклатуры.КодЦеновойГруппы);
			ВывестиСекцию3(ТабДокумент, ОбластьСтрокаНоменклатуры);
			
			
			ВыборкаНарезок = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНарезок.Следующий() Цикл
				
				ОбластьСтрокаНарезки.Параметры.Заполнить(ВыборкаНарезок);
				ВывестиСекцию3(ТабДокумент, ОбластьСтрокаНарезки);
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	ОбластьИтого.Параметры.Заполнить(ВыборкаИтогов);
	ВывестиСекцию3(ТабДокумент, ОбластьИтого);
	
	МассивКолонок.Добавить(ТабДокумент);
	
	
	
	Если ТабДокументГотовый = "" Тогда
		ТабДокументГотовый = Новый ТабличныйДокумент;
		УстановитьПараметрыПечатиТаблицы(ТабДокументГотовый);
		НадоПоказатьОтчет = Истина;
	Иначе
		ТабДокументГотовый.Очистить();
		УстановитьПараметрыПечатиТаблицы(ТабДокументГотовый);
		НадоПоказатьОтчет = Ложь;
	КонецЕсли;
	
	
	
	
	
	
	#Если Клиент Тогда
		Оператор = ЯС_ОбщийМодуль.ПолучитьОператора();
	#Иначе
		Оператор = "";
	#КонецЕсли
	//РабочееМесто = ЯС_Общие.ПолучитьРабочееМесто();
	//Пользователь1С = глЗначениеПеременной("глТекущийПользователь");
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДатаОтчета", Формат(ТекущаяДата(), "ДЛФ=DDT"));
	//ПараметрыПечати.Вставить("Пользователь", СокрЛП(Оператор)+" ("+РабочееМесто+")" + ?(СокрЛП(Оператор)<>СокрЛП(Пользователь1С), " пользователь1С: "+СокрЛП(Пользователь1С), ""));
	//ПараметрыПечати.Вставить("НачальнаяГруппа", НачальнаяГруппа);
	
	
	//Макет = ПолучитьМакет("ОстаткиДляПроизводства_МакетОтчета");
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");  	
	Макет = ОтчетОбъект.ПолучитьМакет("ОстаткиДляПроизводства_МакетОтчета");
	
	
	Если ВыводитьШапку Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаОтчета");
		ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);
		ВывестиСекцию3(ТабДокументГотовый, ОбластьШапка);
	КонецЕсли;
	
	
	
	Для каждого элМассива Из МассивКолонок Цикл
		ТабДокументГотовый.Присоединить(элМассива);
	КонецЦикла;
	
	
	УстановитьПараметрыПечатиТаблицы(ТабДокументГотовый);
	
	
	Если ВыводитьШапку Тогда
		ТабДокументГотовый.ФиксацияСверху = 5;
	Иначе	
		ТабДокументГотовый.ФиксацияСверху = 2;
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокументГотовый.Вывести(ОбластьПодвал);
	
	Если НадоПоказатьОтчет Тогда
		ТабДокументГотовый.Показать("Остатки для производства");
	КонецЕсли;
	
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 09.01.2018

&НаСервере 
Процедура УстановитьПараметрыПечатиСтолбца(Табл)
	
	Табл.ИмяПараметровПечати = "ЯС_ПАРАМЕТРЫ_ПЕЧАТИ_Отчет-ЯС_ОстаткиДляПроизводства";
	
	//Табл.ФиксацияСверху = 2;
	
	Табл.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Табл.ПолеСверху = 18;
	Табл.ПолеСлева = 3;
	Табл.ПолеСправа = 3;
	Табл.ПолеСнизу = 20;
	
	//Табл.НижнийКолонтитул.Выводить = Истина;
	//Табл.НижнийКолонтитул.НачальнаяСтраница = 1;
	//Табл.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	//Табл.НижнийКолонтитул.ТекстСлева = "Дата печати: [&Дата] [&Время]";
	//Табл.НижнийКолонтитул.ТекстСправа = "Страница № [&НомерСтраницы] (из [&СтраницВсего])";
	//Табл.НижнийКолонтитул.Шрифт = Новый Шрифт(Табл.НижнийКолонтитул.Шрифт,,6);
	//
	//Табл.ВерхнийКолонтитул.Выводить = Истина;
	//Табл.ВерхнийКолонтитул.НачальнаяСтраница = 1;
	//Табл.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	//Табл.ВерхнийКолонтитул.ТекстВЦентре = "Остатки";
	//Табл.ВерхнийКолонтитул.Шрифт = Новый Шрифт(Табл.НижнийКолонтитул.Шрифт,,14);
	
	
КонецПроцедуры
&НаСервере
Функция ПолучитьБезПрефикса(Знач КодНомер, УдалятьВедущиеНули=Истина) Экспорт
	
	КодНомер = СокрЛП(КодНомер);
	
	// удаление ведущих букв
	Завершили = Ложь;
	Пока Не Завершили Цикл
		
		Если СтрДлина(КодНомер)=0 Тогда
			Завершили = Истина;
		КонецЕсли;
		
		Символ1 = Лев(КодНомер, 1);
		Если Символ1="0" Или Символ1="1" Или Символ1="2" Или Символ1="3" Или Символ1="4"
			Или Символ1="5"Или Символ1="6" Или Символ1="7" Или Символ1="8" Или Символ1="9" Тогда
			Завершили = Истина;
		КонецЕсли;
		
		Если Не Завершили Тогда
			КодНомер = Сред(КодНомер, 2);
		КонецЕсли;
		
	КонецЦикла;
	
	// удаление ведущих нулей
	Если УдалятьВедущиеНули Тогда
		
		Пока Лев(КодНомер, 1)="0" Цикл
			КодНомер = Сред(КодНомер, 2);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КодНомер;
	
КонецФункции // ПолучитьБезПрефиксов()


//===================================================================================
&НаСервере
Процедура УстановитьПараметрыПечатиТаблицы(Табл)
	
	Табл.ИмяПараметровПечати = "ЯС_ПАРАМЕТРЫ_ПЕЧАТИ_Отчет-ЯС_ОстаткиДляПроизводства";
	
	//Табл.ФиксацияСверху = 2;
	
	Табл.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Табл.ПолеСлева						 = 3;
	Табл.ПолеСправа 					= 3;
//+ Лико m.shenderov 25.05.2018   
	
	Табл.ПолеСлева						= 0;
	Табл.ПолеСправа 					= 0;
//- Лико m.shenderov 25.05.2018
	

	//+Vand
	Табл.ПолеСверху 					= 8;
	Табл.ПолеСнизу						= 0;
	Табл.РазмерКолонтитулаСверху 		= 8;
	Табл.РазмерКолонтитулаСнизу 		= 0;
	//+ Лико m.shenderov 25.05.2018
	Табл.ПолеСверху 					= 0;
	Табл.ПолеСнизу						= 0;
	Табл.РазмерКолонтитулаСверху 		= 0;
	Табл.РазмерКолонтитулаСнизу 		= 0;

	//- Лико m.shenderov 25.05.2018
	
	//Табл.ПолеСверху = 0;
	//Табл.ПолеСнизу = 10;
	//Табл.РазмерКолонтитулаСверху = 0;
	//Табл.РазмерКолонтитулаСнизу = 10;
	//Табл.НижнийКолонтитул.Выводить = Истина;
	//Табл.НижнийКолонтитул.НачальнаяСтраница = 1;
	//Табл.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	//Табл.НижнийКолонтитул.ТекстСлева = "Дата печати: [&Дата] [&Время]";
	//Табл.НижнийКолонтитул.ТекстСправа = "Страница № [&НомерСтраницы] (из [&СтраницВсего])";
	//Табл.НижнийКолонтитул.Шрифт = Новый Шрифт(Табл.НижнийКолонтитул.Шрифт,,6);
	Табл.ВерхнийКолонтитул.Выводить = Истина;
	Табл.ВерхнийКолонтитул.НачальнаяСтраница = 1;
	Табл.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	Табл.ВерхнийКолонтитул.ТекстСлева = "Дата печати: [&Дата] [&Время]";
	Табл.ВерхнийКолонтитул.ТекстСправа = "Страница № [&НомерСтраницы] (из [&СтраницВсего])";
	Табл.ВерхнийКолонтитул.Шрифт = Новый Шрифт(Табл.ВерхнийКолонтитул.Шрифт,,6);
	//-Vand
	
	//Табл.ВерхнийКолонтитул.Выводить = Истина;
	//Табл.ВерхнийКолонтитул.НачальнаяСтраница = 1;
	//Табл.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	//Табл.ВерхнийКолонтитул.ТекстВЦентре = "Остатки";
	//Табл.ВерхнийКолонтитул.Шрифт = Новый Шрифт(Табл.НижнийКолонтитул.Шрифт,,14);
	
	Табл.ТолькоПросмотр = Истина;
	Табл.Вывод = ИспользованиеВывода.Разрешить;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСекцию3(Табл, ОбластьТабл)
	Перем ЭтоВывод;
	
	Если НЕ Табл.ПроверитьВывод(ОбластьТабл) Тогда
		//Табл.ВывестиВертикальныйРазделительСтраниц();
		//Табл = Табл.ПолучитьОбласть("R1C"+(Табл.ШиринаТаблицы+1));
		
		МассивКолонок.Добавить(Табл);
		Табл = Новый ТабличныйДокумент;
		УстановитьПараметрыПечатиСтолбца(Табл);
		ВывестиШапку(Табл);
		
		ЭтоВывод = Ложь;
	Иначе
		ЭтоВывод = Истина;
	КонецЕсли;
	
	
	Если ЭтоВывод Тогда
		Табл.Вывести(ОбластьТабл);
	Иначе
		Табл.Присоединить(ОбластьТабл);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере

Процедура ВывестиШапку(ТабДокумент)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");  	
	Макет = ОтчетОбъект.ПолучитьМакет("ОстаткиДляПроизводства_МакетТаблицы");
	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ВывестиСекцию3(ТабДокумент, ОбластьШапка);
	
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок=Новый ТабличныйДокумент;
	ОстаткиДляПроизводстваВ4(ТабДок);
	//ТабличныйДокумент=ТабДок;
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПоРабочимЦентрамПриИзменении(Элемент)
	Элементы.СписокРЦ.Доступность=ПоРабочимЦентрам;
	Если ПоРабочимЦентрам и СкладБрака Тогда
		СкладБрака=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СписокЗначенийРЦ() //+Лико m.shenderov 20.01.2018  
	СписокРЦЗначений = Новый СписокЗначений;
	
	Для каждого РЦ Из Отчет.СписокРабочихЦентров.РабочиеЦентры Цикл
		Если ЗначениеЗаполнено(Рц.РабочийЦентр.ЛикоЯчейка) Тогда
			СписокРЦЗначений.Добавить(Рц.РабочийЦентр.ЛикоЯчейка);
		КонецЕсли;
		
		
		
	КонецЦикла;
	Возврат СписокРЦЗначений;
КонецФункции  //-Лико m.shenderov 20.01.2018

&НаКлиенте
Процедура СкладБракаПриИзменении(Элемент)
	Если ПоРабочимЦентрам и СкладБрака Тогда
		ПоРабочимЦентрам=Ложь;
		ПоРабочимЦентрамПриИзменении(Неопределено);
	КонецЕсли;
	
	
	
КонецПроцедуры



МассивКолонок = Новый Массив;
